tonyrang/dsp_study/03-firmware/TMS320F28075/adc_ex1_soc_software/device/driverlib/inc/hw_memcfg.h
//###########################################################################
//
// FILE:    hw_memcfg.h
//
// TITLE:   Definitions for the MEMCFG registers.
//
//###########################################################################
// $TI Release: F2807x Support Library v3.10.00.00 $
// $Release Date: Tue May 26 17:19:45 IST 2020 $
// $Copyright:
// Copyright (C) 2014-2020 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_MEMCFG_H
#define HW_MEMCFG_H

//*****************************************************************************
//
// The following are defines for the MEMCFG register offsets
//
//*****************************************************************************
#define MEMCFG_O_DXLOCK           0x0U         // Dedicated RAM Config Lock
                                               // Register
#define MEMCFG_O_DXCOMMIT         0x2U         // Dedicated RAM Config Lock
                                               // Commit Register
#define MEMCFG_O_DXACCPROT0       0x8U         // Dedicated RAM Config Register
#define MEMCFG_O_DXTEST           0x10U        // Dedicated RAM TEST Register
#define MEMCFG_O_DXINIT           0x12U        // Dedicated RAM Init Register
#define MEMCFG_O_DXINITDONE       0x14U        // Dedicated RAM InitDone Status
                                               // Register
#define MEMCFG_O_LSXLOCK          0x20U        // Local Shared RAM Config Lock
                                               // Register
#define MEMCFG_O_LSXCOMMIT        0x22U        // Local Shared RAM Config Lock
                                               // Commit Register
#define MEMCFG_O_LSXMSEL          0x24U        // Local Shared RAM Master Sel
                                               // Register
#define MEMCFG_O_LSXCLAPGM        0x26U        // Local Shared RAM Prog/Exe
                                               // control Register
#define MEMCFG_O_LSXACCPROT0      0x28U        // Local Shared RAM Config
                                               // Register 0
#define MEMCFG_O_LSXACCPROT1      0x2AU        // Local Shared RAM Config
                                               // Register 1
#define MEMCFG_O_LSXTEST          0x30U        // Local Shared RAM TEST
                                               // Register
#define MEMCFG_O_LSXINIT          0x32U        // Local Shared RAM Init
                                               // Register
#define MEMCFG_O_LSXINITDONE      0x34U        // Local Shared RAM InitDone
                                               // Status Register
#define MEMCFG_O_GSXLOCK          0x40U        // Global Shared RAM Config Lock
                                               // Register
#define MEMCFG_O_GSXCOMMIT        0x42U        // Global Shared RAM Config Lock
                                               // Commit Register
#define MEMCFG_O_GSXACCPROT0      0x48U        // Global Shared RAM Config
                                               // Register 0
#define MEMCFG_O_GSXACCPROT1      0x4AU        // Global Shared RAM Config
                                               // Register 1
#define MEMCFG_O_GSXACCPROT2      0x4CU        // Global Shared RAM Config
                                               // Register 2
#define MEMCFG_O_GSXACCPROT3      0x4EU        // Global Shared RAM Config
                                               // Register 3
#define MEMCFG_O_GSXTEST          0x50U        // Global Shared RAM TEST
                                               // Register
#define MEMCFG_O_GSXINIT          0x52U        // Global Shared RAM Init
                                               // Register
#define MEMCFG_O_GSXINITDONE      0x54U        // Global Shared RAM InitDone
                                               // Status Register
#define MEMCFG_O_MSGXTEST         0x70U        // Message RAM TEST Register
#define MEMCFG_O_MSGXINIT         0x72U        // Message RAM Init Register
#define MEMCFG_O_MSGXINITDONE     0x74U        // Message RAM InitDone Status
                                               // Register
#define MEMCFG_O_EMIF1LOCK        0x0U         // EMIF1 Config Lock Register
#define MEMCFG_O_EMIF1COMMIT      0x2U         // EMIF1 Config Lock Commit
                                               // Register
#define MEMCFG_O_EMIF1ACCPROT0    0x8U         // EMIF1 Config Register 0
#define MEMCFG_O_EMIF2LOCK        0x0U         // EMIF2 Config Lock Register
#define MEMCFG_O_EMIF2COMMIT      0x2U         // EMIF2 Config Lock Commit
                                               // Register
#define MEMCFG_O_EMIF2ACCPROT0    0x8U         // EMIF2 Config Register 0
#define MEMCFG_O_NMAVFLG          0x0U         // Non-Master Access Violation
                                               // Flag Register
#define MEMCFG_O_NMAVSET          0x2U         // Non-Master Access Violation
                                               // Flag Set Register
#define MEMCFG_O_NMAVCLR          0x4U         // Non-Master Access Violation
                                               // Flag Clear Register
#define MEMCFG_O_NMAVINTEN        0x6U         // Non-Master Access Violation
                                               // Interrupt Enable Register
#define MEMCFG_O_NMCPURDAVADDR    0x8U         // Non-Master CPU Read Access
                                               // Violation Address
#define MEMCFG_O_NMCPUWRAVADDR    0xAU         // Non-Master CPU Write Access
                                               // Violation Address
#define MEMCFG_O_NMCPUFAVADDR     0xCU         // Non-Master CPU Fetch Access
                                               // Violation Address
#define MEMCFG_O_NMDMAWRAVADDR    0xEU         // Non-Master DMA Write Access
                                               // Violation Address
#define MEMCFG_O_NMCLA1RDAVADDR   0x10U        // Non-Master CLA1 Read Access
                                               // Violation Address
#define MEMCFG_O_NMCLA1WRAVADDR   0x12U        // Non-Master CLA1 Write Access
                                               // Violation Address
#define MEMCFG_O_NMCLA1FAVADDR    0x14U        // Non-Master CLA1 Fetch Access
                                               // Violation Address
#define MEMCFG_O_MAVFLG           0x20U        // Master Access Violation Flag
                                               // Register
#define MEMCFG_O_MAVSET           0x22U        // Master Access Violation Flag
                                               // Set Register
#define MEMCFG_O_MAVCLR           0x24U        // Master Access Violation Flag
                                               // Clear Register
#define MEMCFG_O_MAVINTEN         0x26U        // Master Access Violation
                                               // Interrupt Enable Register
#define MEMCFG_O_MCPUFAVADDR      0x28U        // Master CPU Fetch Access
                                               // Violation Address
#define MEMCFG_O_MCPUWRAVADDR     0x2AU        // Master CPU Write Access
                                               // Violation Address
#define MEMCFG_O_MDMAWRAVADDR     0x2CU        // Master  DMA Write Access
                                               // Violation Address
#define MEMCFG_O_UCERRFLG         0x0U         // Uncorrectable Error Flag
                                               // Register
#define MEMCFG_O_UCERRSET         0x2U         // Uncorrectable Error Flag Set
                                               // Register
#define MEMCFG_O_UCERRCLR         0x4U         // Uncorrectable Error Flag
                                               // Clear Register
#define MEMCFG_O_UCCPUREADDR      0x6U         // Uncorrectable CPU Read Error
                                               // Address
#define MEMCFG_O_UCDMAREADDR      0x8U         // Uncorrectable DMA Read Error
                                               // Address
#define MEMCFG_O_UCCLA1READDR     0xAU         // Uncorrectable CLA1 Read Error
                                               // Address
#define MEMCFG_O_CERRFLG          0x20U        // Correctable Error Flag
                                               // Register
#define MEMCFG_O_CERRSET          0x22U        // Correctable Error Flag Set
                                               // Register
#define MEMCFG_O_CERRCLR          0x24U        // Correctable Error Flag Clear
                                               // Register
#define MEMCFG_O_CCPUREADDR       0x26U        // Correctable CPU Read Error
                                               // Address
#define MEMCFG_O_CERRCNT          0x2EU        // Correctable Error Count
                                               // Register
#define MEMCFG_O_CERRTHRES        0x30U        // Correctable Error Threshold
                                               // Value Register
#define MEMCFG_O_CEINTFLG         0x32U        // Correctable Error Interrupt
                                               // Flag Status Register
#define MEMCFG_O_CEINTCLR         0x34U        // Correctable Error Interrupt
                                               // Flag Clear Register
#define MEMCFG_O_CEINTSET         0x36U        // Correctable Error Interrupt
                                               // Flag Set Register
#define MEMCFG_O_CEINTEN          0x38U        // Correctable Error Interrupt
                                               // Enable Register
#define MEMCFG_O_ROMWAITSTATE     0x0U         // ROM Wait State Configuration
                                               // Register
#define MEMCFG_O_ROMPREFETCH      0x0U         // ROM Prefetch Configuration
                                               // Register

//*****************************************************************************
//
// The following are defines for the bit fields in the DXLOCK register
//
//*****************************************************************************
#define MEMCFG_DXLOCK_LOCK_D0     0x4U         // D0 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_DXLOCK_LOCK_D1     0x8U         // D1 RAM access protection and
                                               // master select fields lock bit

//*****************************************************************************
//
// The following are defines for the bit fields in the DXCOMMIT register
//
//*****************************************************************************
#define MEMCFG_DXCOMMIT_COMMIT_D0  0x4U         // D0 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_DXCOMMIT_COMMIT_D1  0x8U         // D1 RAM access protection and
                                               // master select permanent lock

//*****************************************************************************
//
// The following are defines for the bit fields in the DXACCPROT0 register
//
//*****************************************************************************
#define MEMCFG_DXACCPROT0_FETCHPROT_D0  0x10000U     // Fetch Protection For D0 RAM
#define MEMCFG_DXACCPROT0_CPUWRPROT_D0  0x20000U     // CPU WR Protection For D0 RAM
#define MEMCFG_DXACCPROT0_FETCHPROT_D1  0x1000000U   // Fetch Protection For D1 RAM
#define MEMCFG_DXACCPROT0_CPUWRPROT_D1  0x2000000U   // CPU WR Protection For D1 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the DXTEST register
//
//*****************************************************************************
#define MEMCFG_DXTEST_TEST_M0_S   0U
#define MEMCFG_DXTEST_TEST_M0_M   0x3U         // Selects the different modes
                                               // for M0 RAM
#define MEMCFG_DXTEST_TEST_M1_S   2U
#define MEMCFG_DXTEST_TEST_M1_M   0xCU         // Selects the different modes
                                               // for M1 RAM
#define MEMCFG_DXTEST_TEST_D0_S   4U
#define MEMCFG_DXTEST_TEST_D0_M   0x30U        // Selects the different modes
                                               // for D0 RAM
#define MEMCFG_DXTEST_TEST_D1_S   6U
#define MEMCFG_DXTEST_TEST_D1_M   0xC0U        // Selects the different modes
                                               // for D1 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the DXINIT register
//
//*****************************************************************************
#define MEMCFG_DXINIT_INIT_M0     0x1U         // RAM Initialization control
                                               // for M0 RAM.
#define MEMCFG_DXINIT_INIT_M1     0x2U         // RAM Initialization control
                                               // for M1 RAM.
#define MEMCFG_DXINIT_INIT_D0     0x4U         // RAM Initialization control
                                               // for D0 RAM.
#define MEMCFG_DXINIT_INIT_D1     0x8U         // RAM Initialization control
                                               // for D1 RAM.

//*****************************************************************************
//
// The following are defines for the bit fields in the DXINITDONE register
//
//*****************************************************************************
#define MEMCFG_DXINITDONE_INITDONE_M0  0x1U         // RAM Initialization status for
                                               // M0 RAM.
#define MEMCFG_DXINITDONE_INITDONE_M1  0x2U         // RAM Initialization status for
                                               // M1 RAM.
#define MEMCFG_DXINITDONE_INITDONE_D0  0x4U         // RAM Initialization status for
                                               // D0 RAM.
#define MEMCFG_DXINITDONE_INITDONE_D1  0x8U         // RAM Initialization status for
                                               // D1 RAM.

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXLOCK register
//
//*****************************************************************************
#define MEMCFG_LSXLOCK_LOCK_LS0   0x1U         // LS0 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_LSXLOCK_LOCK_LS1   0x2U         // LS1 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_LSXLOCK_LOCK_LS2   0x4U         // LS2 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_LSXLOCK_LOCK_LS3   0x8U         // LS3 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_LSXLOCK_LOCK_LS4   0x10U        // LS4 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_LSXLOCK_LOCK_LS5   0x20U        // LS5 RAM access protection and
                                               // master select fields lock bit

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXCOMMIT register
//
//*****************************************************************************
#define MEMCFG_LSXCOMMIT_COMMIT_LS0  0x1U         // LS0 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_LSXCOMMIT_COMMIT_LS1  0x2U         // LS1 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_LSXCOMMIT_COMMIT_LS2  0x4U         // LS2 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_LSXCOMMIT_COMMIT_LS3  0x8U         // LS3 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_LSXCOMMIT_COMMIT_LS4  0x10U        // LS4 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_LSXCOMMIT_COMMIT_LS5  0x20U        // LS5 RAM access protection and
                                               // master select permanent lock

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXMSEL register
//
//*****************************************************************************
#define MEMCFG_LSXMSEL_MSEL_LS0_S  0U
#define MEMCFG_LSXMSEL_MSEL_LS0_M  0x3U         // Master Select for LS0 RAM
#define MEMCFG_LSXMSEL_MSEL_LS1_S  2U
#define MEMCFG_LSXMSEL_MSEL_LS1_M  0xCU         // Master Select for LS1 RAM
#define MEMCFG_LSXMSEL_MSEL_LS2_S  4U
#define MEMCFG_LSXMSEL_MSEL_LS2_M  0x30U        // Master Select for LS2 RAM
#define MEMCFG_LSXMSEL_MSEL_LS3_S  6U
#define MEMCFG_LSXMSEL_MSEL_LS3_M  0xC0U        // Master Select for LS3 RAM
#define MEMCFG_LSXMSEL_MSEL_LS4_S  8U
#define MEMCFG_LSXMSEL_MSEL_LS4_M  0x300U       // Master Select for LS4 RAM
#define MEMCFG_LSXMSEL_MSEL_LS5_S  10U
#define MEMCFG_LSXMSEL_MSEL_LS5_M  0xC00U       // Master Select for LS5 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXCLAPGM register
//
//*****************************************************************************
#define MEMCFG_LSXCLAPGM_CLAPGM_LS0  0x1U         // Selects LS0 RAM as program vs
                                               // data memory for CLA
#define MEMCFG_LSXCLAPGM_CLAPGM_LS1  0x2U         // Selects LS1 RAM as program vs
                                               // data memory for CLA
#define MEMCFG_LSXCLAPGM_CLAPGM_LS2  0x4U         // Selects LS2 RAM as program vs
                                               // data memory for CLA
#define MEMCFG_LSXCLAPGM_CLAPGM_LS3  0x8U         // Selects LS3 RAM as program vs
                                               // data memory for CLA
#define MEMCFG_LSXCLAPGM_CLAPGM_LS4  0x10U        // Selects LS4 RAM as program vs
                                               // data memory for CLA
#define MEMCFG_LSXCLAPGM_CLAPGM_LS5  0x20U        // Selects LS5 RAM as program vs
                                               // data memory for CLA

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXACCPROT0 register
//
//*****************************************************************************
#define MEMCFG_LSXACCPROT0_FETCHPROT_LS0  0x1U         // Fetch Protection For LS0 RAM
#define MEMCFG_LSXACCPROT0_CPUWRPROT_LS0  0x2U         // CPU WR Protection For LS0 RAM
#define MEMCFG_LSXACCPROT0_FETCHPROT_LS1  0x100U       // Fetch Protection For LS1 RAM
#define MEMCFG_LSXACCPROT0_CPUWRPROT_LS1  0x200U       // CPU WR Protection For LS1 RAM
#define MEMCFG_LSXACCPROT0_FETCHPROT_LS2  0x10000U     // Fetch Protection For LS2 RAM
#define MEMCFG_LSXACCPROT0_CPUWRPROT_LS2  0x20000U     // CPU WR Protection For LS2 RAM
#define MEMCFG_LSXACCPROT0_FETCHPROT_LS3  0x1000000U   // Fetch Protection For LS3 RAM
#define MEMCFG_LSXACCPROT0_CPUWRPROT_LS3  0x2000000U   // CPU WR Protection For LS3 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXACCPROT1 register
//
//*****************************************************************************
#define MEMCFG_LSXACCPROT1_FETCHPROT_LS4  0x1U         // Fetch Protection For LS4 RAM
#define MEMCFG_LSXACCPROT1_CPUWRPROT_LS4  0x2U         // CPU WR Protection For LS4 RAM
#define MEMCFG_LSXACCPROT1_FETCHPROT_LS5  0x100U       // Fetch Protection For LS5 RAM
#define MEMCFG_LSXACCPROT1_CPUWRPROT_LS5  0x200U       // CPU WR Protection For LS5 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXTEST register
//
//*****************************************************************************
#define MEMCFG_LSXTEST_TEST_LS0_S  0U
#define MEMCFG_LSXTEST_TEST_LS0_M  0x3U         // Selects the different modes
                                               // for LS0 RAM
#define MEMCFG_LSXTEST_TEST_LS1_S  2U
#define MEMCFG_LSXTEST_TEST_LS1_M  0xCU         // Selects the different modes
                                               // for LS1 RAM
#define MEMCFG_LSXTEST_TEST_LS2_S  4U
#define MEMCFG_LSXTEST_TEST_LS2_M  0x30U        // Selects the different modes
                                               // for LS2 RAM
#define MEMCFG_LSXTEST_TEST_LS3_S  6U
#define MEMCFG_LSXTEST_TEST_LS3_M  0xC0U        // Selects the different modes
                                               // for LS3 RAM
#define MEMCFG_LSXTEST_TEST_LS4_S  8U
#define MEMCFG_LSXTEST_TEST_LS4_M  0x300U       // Selects the different modes
                                               // for LS4 RAM
#define MEMCFG_LSXTEST_TEST_LS5_S  10U
#define MEMCFG_LSXTEST_TEST_LS5_M  0xC00U       // Selects the different modes
                                               // for LS5 RAM

